# Exploratory Data Analysis

## Global

在Global里面导packages和define一些常用的variable

然后在各自的section里面尝试EDA

这样可以统一命名，希望不会有merge conflict

另外, [nbdime](https://nbdime.readthedocs.io/en/latest/index.html)看起来像是一个可以帮助解决merge conflict的东西，可以试一试

General [merge conflict solution](http://allendowney.github.io/amgit/conflict.html)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
!ls dataSets/training

links (table 3).csv                volume(table 6)_training.csv
routes (table 4).csv               weather (table 7)_training.csv
trajectories(table 5)_training.csv

In [93]:
training_path1 = "dataSets/training/"
links = pd.read_csv(training_path1+'links (table 3).csv')
volume = pd.read_csv(training_path1+'volume(table 6)_training.csv')
routes = pd.read_csv(training_path1+'routes (table 4).csv')
weather = pd.read_csv(training_path1+'weather (table 7)_training.csv')
trajectories = pd.read_csv(training_path1+'trajectories(table 5)_training.csv')

## Muci's Section

In [17]:
training_path1 = "dataSets/training/"
links = pd.read_csv(training_path1+'links (table 3).csv')
print(links.shape)
print(links.info())
links.head()

(24, 7)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 7 columns):
link_id       24 non-null int64
length        24 non-null int64
width         24 non-null int64
lanes         24 non-null int64
in_top        21 non-null object
out_top       21 non-null object
lane_width    24 non-null int64
dtypes: int64(5), object(2)
memory usage: 1.4+ KB
None

   link_id  length  width  lanes in_top  out_top  lane_width
0      100      58      3      1    105      111           3
1      101      84      3      1    116      121           3
2      102     131      9      3    115      109           3
3      103      23     12      4    111  122,116           3
4      104     293      9      3    109      112           3

In [18]:
volume = pd.read_csv(training_path1+'volume(table 6)_training.csv')
print(volume.shape)
print(volume.info())
volume.head()

(543699, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 543699 entries, 0 to 543698
Data columns (total 6 columns):
time             543699 non-null object
tollgate_id      543699 non-null int64
direction        543699 non-null int64
vehicle_model    543699 non-null int64
has_etc          543699 non-null int64
vehicle_type     212710 non-null float64
dtypes: float64(1), int64(4), object(1)
memory usage: 24.9+ MB
None

,time,tollgate_id,direction,vehicle_model,has_etc,vehicle_type
0,2016-09-19 23:09:25,2,0,1,0,NaN
1,2016-09-19 23:11:53,2,0,1,0,NaN
2,2016-09-19 23:13:54,2,0,1,0,NaN
3,2016-09-19 23:17:48,1,0,1,1,NaN
4,2016-09-19 23:16:07,2,0,1,0,NaN

In [19]:
routes = pd.read_csv(training_path1+'routes (table 4).csv')
print(routes.shape)
print(routes.info())
routes.head()

(6, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
intersection_id    6 non-null object
tollgate_id        6 non-null int64
link_seq           6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

,intersection_id,tollgate_id,link_seq
0,A,2,"110,123,107,108,120,117"
1,A,3,"110,123,107,108,119,114,118,122"
2,B,1,"105,100,111,103,116,101,121,106,113"
3,B,3,"105,100,111,103,122"
4,C,1,"115,102,109,104,112,111,103,116,101,121,106,113"

In [20]:
weather = pd.read_csv(training_path1+'weather (table 7)_training.csv')
print(weather.shape)
print(weather.info())
weather.head()

(782, 9)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 782 entries, 0 to 781
Data columns (total 9 columns):
date              782 non-null object
hour              782 non-null int64
pressure          782 non-null float64
sea_pressure      782 non-null float64
wind_direction    782 non-null float64
wind_speed        782 non-null float64
temperature       782 non-null float64
rel_humidity      782 non-null float64
precipitation     782 non-null float64
dtypes: float64(7), int64(1), object(1)
memory usage: 55.1+ KB
None

,date,hour,pressure,sea_pressure,wind_direction,wind_speed,temperature,rel_humidity,precipitation
0,2016-07-01,0,1000.4,1005.3,225.0,2.1,26.4,94.0,0.0
1,2016-07-01,3,1000.5,1005.3,187.0,2.7,29.0,76.0,0.0
2,2016-07-01,6,998.9,1003.7,212.0,2.9,31.7,67.0,0.0
3,2016-07-01,9,998.7,1003.5,244.0,2.7,31.6,59.0,0.0
4,2016-07-01,12,999.7,1004.5,222.0,1.3,29.9,68.0,0.0

In [21]:
trajectories = pd.read_csv(training_path1+'trajectories(table 5)_training.csv')
print(trajectories.shape)
print(trajectories.info())
trajectories.head()

(109244, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109244 entries, 0 to 109243
Data columns (total 6 columns):
intersection_id    109244 non-null object
tollgate_id        109244 non-null int64
vehicle_id         109244 non-null int64
starting_time      109244 non-null object
travel_seq         109244 non-null object
travel_time        109244 non-null float64
dtypes: float64(1), int64(2), object(3)
memory usage: 5.0+ MB
None

,intersection_id,tollgate_id,vehicle_id,starting_time,travel_seq,travel_time
0,B,3,1065642,2016-07-19 00:14:24,105#2016-07-19 00:14:24#9.56;100#2016-07-19 00...,70.85
1,B,3,1047198,2016-07-19 00:35:56,105#2016-07-19 00:35:56#11.58;100#2016-07-19 0...,148.79
2,B,1,1086390,2016-07-19 00:37:15,105#2016-07-19 00:37:15#5.26;100#2016-07-19 00...,79.76
3,A,2,1071181,2016-07-19 00:37:59,110#2016-07-19 00:37:59#13.74;123#2016-07-19 0...,58.05
4,B,1,1065807,2016-07-19 00:56:21,105#2016-07-19 00:56:21#16.08;100#2016-07-19 0...,137.98

## Estella's Section

In [6]:
links.head()

   link_id  length  width  lanes in_top  out_top  lane_width
0      100      58      3      1    105      111           3
1      101      84      3      1    116      121           3
2      102     131      9      3    115      109           3
3      103      23     12      4    111  122,116           3
4      104     293      9      3    109      112           3

In [13]:
links.isnull().sum()

link_id       0
length        0
width         0
lanes         0
in_top        3
out_top       3
lane_width    0
dtype: int64

In [18]:
links.shape

(24, 7)

In [7]:
volume.head()

,time,tollgate_id,direction,vehicle_model,has_etc,vehicle_type
0,2016-09-19 23:09:25,2,0,1,0,NaN
1,2016-09-19 23:11:53,2,0,1,0,NaN
2,2016-09-19 23:13:54,2,0,1,0,NaN
3,2016-09-19 23:17:48,1,0,1,1,NaN
4,2016-09-19 23:16:07,2,0,1,0,NaN

In [14]:
volume.isnull().sum()

time                  0
tollgate_id           0
direction             0
vehicle_model         0
has_etc               0
vehicle_type     330989
dtype: int64

In [19]:
volume.shape

(543699, 6)

In [8]:
routes.head()

,intersection_id,tollgate_id,link_seq
0,A,2,"110,123,107,108,120,117"
1,A,3,"110,123,107,108,119,114,118,122"
2,B,1,"105,100,111,103,116,101,121,106,113"
3,B,3,"105,100,111,103,122"
4,C,1,"115,102,109,104,112,111,103,116,101,121,106,113"

In [54]:
type(routes["tollgate_id"][0])

str

In [53]:
routes["tollgate_id"] = routes["tollgate_id"].astype(str)

In [15]:
routes.isnull().sum()

intersection_id    0
tollgate_id        0
link_seq           0
dtype: int64

In [20]:
routes.shape

(6, 3)

In [9]:
weather.head()

,date,hour,pressure,sea_pressure,wind_direction,wind_speed,temperature,rel_humidity,precipitation
0,2016-07-01,0,1000.4,1005.3,225.0,2.1,26.4,94.0,0.0
1,2016-07-01,3,1000.5,1005.3,187.0,2.7,29.0,76.0,0.0
2,2016-07-01,6,998.9,1003.7,212.0,2.9,31.7,67.0,0.0
3,2016-07-01,9,998.7,1003.5,244.0,2.7,31.6,59.0,0.0
4,2016-07-01,12,999.7,1004.5,222.0,1.3,29.9,68.0,0.0

In [16]:
weather.isnull().sum()

date              0
hour              0
pressure          0
sea_pressure      0
wind_direction    0
wind_speed        0
temperature       0
rel_humidity      0
precipitation     0
dtype: int64

In [21]:
weather.shape

(782, 9)

In [41]:
trajectories.head()

,intersection_id,tollgate_id,vehicle_id,starting_time,travel_seq,travel_time
0,B,3,1065642,2016-07-19 00:14:24,105#2016-07-19 00:14:24#9.56;100#2016-07-19 00...,70.85
1,B,3,1047198,2016-07-19 00:35:56,105#2016-07-19 00:35:56#11.58;100#2016-07-19 0...,148.79
2,B,1,1086390,2016-07-19 00:37:15,105#2016-07-19 00:37:15#5.26;100#2016-07-19 00...,79.76
3,A,2,1071181,2016-07-19 00:37:59,110#2016-07-19 00:37:59#13.74;123#2016-07-19 0...,58.05
4,B,1,1065807,2016-07-19 00:56:21,105#2016-07-19 00:56:21#16.08;100#2016-07-19 0...,137.98

- travel_seq: link id, enter time, travel time

In [42]:
trajectories.isnull().sum()

intersection_id    0
tollgate_id        0
vehicle_id         0
starting_time      0
travel_seq         0
travel_time        0
dtype: int64

In [43]:
trajectories.shape

(109244, 6)

In [36]:
trajectories["travel_seq"][0]

'105#2016-07-19 00:14:24#9.56;100#2016-07-19 00:14:34#6.75;111#2016-07-19 00:14:41#13.00;103#2016-07-19 00:14:54#7.47;122#2016-07-19 00:15:02#32.85'

In [30]:
trajectories["link_id"] = trajectories["travel_seq"].str[:3]

In [31]:
trajectories["travel_seq"].str[4:23]

0         2016-07-19 00:14:24
1         2016-07-19 00:35:56
2         2016-07-19 00:37:15
3         2016-07-19 00:37:59
4         2016-07-19 00:56:21
5         2016-07-19 00:56:31
6         2016-07-19 01:26:03
7         2016-07-19 01:36:04
8         2016-07-19 01:36:20
9         2016-07-19 01:36:28
10        2016-07-19 01:38:48
11        2016-07-19 01:40:40
12        2016-07-19 01:42:22
13        2016-07-19 01:44:57
14        2016-07-19 01:46:36
15        2016-07-19 01:48:40
16        2016-07-19 01:48:47
17        2016-07-19 01:52:08
18        2016-07-19 02:10:44
19        2016-07-19 02:20:16
20        2016-07-19 02:36:20
21        2016-07-19 02:38:10
22        2016-07-19 02:42:15
23        2016-07-19 02:42:22
24        2016-07-19 02:42:24
25        2016-07-19 02:44:00
26        2016-07-19 02:58:39
27        2016-07-19 03:12:37
28        2016-07-19 03:27:36
29        2016-07-19 03:36:02
                 ...
109214    2016-10-17 22:35:53
109215    2016-10-17 22:42:49
109216    2016-10-17 22:45:00
109217    2016-10-17 22:50:11
109218    2016-10-17 22:50:23
109219    2016-10-17 22:51:12
109220    2016-10-17 22:56:18
109221    2016-10-17 22:57:13
109222    2016-10-17 23:06:06
109223    2016-10-17 23:07:24
109224    2016-10-17 23:08:13
109225    2016-10-17 23:08:18
109226    2016-10-17 23:10:45
109227    2016-10-17 23:13:29
109228    2016-10-17 23:14:16
109229    2016-10-17 23:14:17
109230    2016-10-17 23:20:17
109231    2016-10-17 23:21:50
109232    2016-10-17 23:22:08
109233    2016-10-17 23:22:19
109234    2016-10-17 23:29:43
109235    2016-10-17 23:30:10
109236    2016-10-17 23:30:43
109237    2016-10-17 23:35:56
109238    2016-10-17 23:37:31
109239    2016-10-17 23:38:52
109240    2016-10-17 23:40:19
109241    2016-10-17 23:52:18
109242    2016-10-17 23:53:57
109243    2016-10-17 23:54:35
Name: travel_seq, Length: 109244, dtype: object

In [32]:
trajectories["enter_time"] = trajectories["travel_seq"].str[4:23]

In [ ]:
trajectories["travel_time"]

In [58]:
type(routes["tollgate_id"][0])

str

In [92]:
def mapping(df):
    if df["intersection_id"] == 'A' & df["tollgate_id"] == 2:
        df[(df["link_seq"])] = "110,123,107,108,120,117"
    if df["intersection_id"] == 'A' | df["tollgate_id"] == 3:
        df["link_seq"] = "110,123,107,108,119,114,118,122"
    if df["intersection_id"] == 'B' | df["tollgate_id"] == 1:
        df["link_seq"] = "105,100,111,103,116,101,121,106,113"
    if df["intersection_id"] == 'B' | df["tollgate_id"] == 3:
        df["link_seq"] = "105,100,111,103,122"
    if df["intersection_id"] == 'C' | df["tollgate_id"] == 1:
        df["link_seq"] = "115,102,109,104,112,111,103,116,101,121,106,113"
    return df

In [89]:
trajectories.head()

,intersection_id,tollgate_id,vehicle_id,starting_time,travel_seq,travel_time
0,B,3,1065642,2016-07-19 00:14:24,105#2016-07-19 00:14:24#9.56;100#2016-07-19 00...,70.85
1,B,3,1047198,2016-07-19 00:35:56,105#2016-07-19 00:35:56#11.58;100#2016-07-19 0...,148.79
2,B,1,1086390,2016-07-19 00:37:15,105#2016-07-19 00:37:15#5.26;100#2016-07-19 00...,79.76
3,A,2,1071181,2016-07-19 00:37:59,110#2016-07-19 00:37:59#13.74;123#2016-07-19 0...,58.05
4,B,1,1065807,2016-07-19 00:56:21,105#2016-07-19 00:56:21#16.08;100#2016-07-19 0...,137.98